/// Здесь описано 2 функции. Пронумеруем их 1 и 2.
/// Вам нужно реализовать одну из них.
/// Номер задания - остаток от деления на 2 Вашего номера в списке группы.

/**
Возвращает новую матрицу, которая является транспонированной версией arr

Например,

1 2           1 3 5
3 4    --->   2 4 6
5 6
*/
Matrix Transpose(Matrix& arr)
{
    return CreateEmptyMatrix(); // TODO
}

/**
Выполняет перемножение двух матриц и возвращает результат перемножения.
Функция должна проверить, что перемножение возможно: размеры матриц должны быть m*n и n*k.
Если перемножение невозможно, следует вернуть пустую матрицу (воспользуйтесь CreateEmptyMatrix).
*/
Matrix MultiplyMatrixes(Matrix& a, Matrix& b)
{
    return CreateEmptyMatrix(); // TODO
}
